Repository: fummicc1/se-masked-quiz
Catalog: ios/se-masked-quiz/Localizable.xcstrings
Source language: ja
Languages: en

source: (%lld/%lld問正解)
en: (%lld/%lld correct)

source: LLMクイズを生成するには、設定画面からモデルをダウンロードしてください。
en: To generate LLM quizzes, download a model from Settings.

source: このプロポーザルのクイズの進捗をリセットしますか？ この操作は取り消せません。
en: Reset your quiz progress for this proposal? This action cannot be undone.

source: キャンセル
en: Cancel

source: クイズをリセット
en: Reset quiz

source: クイズを生成
en: Generate quiz

source: 不正解、答えは %@
en: Incorrect. The answer is %@

source: 不正解...
en: Incorrect...

source: 依存グラフ
en: Dependency graph

source: 先に読むと理解しやすい提案
en: Proposals worth reading first

source: 全問解答済み
en: All questions answered

source: モデルのダウンロードが必要
en: Model download required

source: リセット
en: Reset

source: 現在のスコア: %@
en: Current score: %@

source: 次の問題へ
en: Next question

source: 次の未解答の空欄まで本文をスクロールします
en: Scrolls the article to the next unanswered blank

source: 正解
en: Correct

source: 正解！
en: Correct!

source: 生成済みクイズを開く
en: Open generated quiz

source: 空欄 {position}、不正解、答えは {answer}
en: Blank {position}, incorrect. The answer is {answer}

source: 空欄 {position}、正解、答えは {answer}
en: Blank {position}, correct. The answer is {answer}

source: 空欄 {position}、未解答
en: Blank {position}, unanswered

source: 閉じる
en: Close
